Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Визуализатор Куб: исправлена ошибка "Значение индекса 0 параметра "Items" вне диапазона [0; -1]", которая в редких случаях возникала при нажатии на иконку выбора значений фильтра в Кубе (#8093).
en: Cube visualizer: the following error was corrected: "Value of 0 index of "Items" parameter" is out of [0; -1] range". It occurred in rare cases when pressing on icon of the filter value selection in Cube (#8093).

source: Визуализатор Профили кластеров: Если на обученном узле Кластеризация настроить визуализатор и открыть таблицу Детализация, выйти в сценарий и снова войти в настроенный визуализатор (через боковую панель Навигация), то на таблице Детализация была длительная маска «Загрузка».
en: Cluster profiles visualizer: If visualizer is configured for the trained Clustering node and Detailing table is opened, and the user moves to the workflow and enters the configured visualizer again (via the Navigation side bar), the "Loading" mask is preserved on the Detailing table for a long time.

source: Визуализатор Таблица: Исправлена ошибка «Набор данных не находится в закрытом состоянии», которая возникала, если в таблице с большим количеством колонок (~200) настроить сортировку по ~20 столбцам, быстро перейти в сценарий, открытый на соседней вкладке, и деактивировать узел, на котором настроен визуализатор (#9963).
en: Table visualizer: The following error was corrected: "Data set is not in the closed state". It occurred if the user set the sorting by ~20 columns in the table with many columns (~200), quickly went to the workflow opened on the next tab and deactivated the node on which the visualizer was configured (#9963).

source: Выполнение узла: исправлена ошибка которая возникала, когда «Выполнение узла» ссылался на производный узел, у которого не найден исходный компонент.
en: Node Execution: The error that occurred when "Node Execution" referred to the derived node for which the source component was not found was corrected.

source: Выполнение узла: если в настройках «Выполнения узла» в качестве выполняемого выбирался узел, для которого ранее порядок выполнения ранее был задан таким образом, что узел «Выполнения узла» должен выполниться раньше выбираемого узла, то возникала ошибка «Переход запрещен.
en: Node Execution: if in "Node Execution" settings the node for which the execution order had been earlier set as the selected one in such a way that "Node Execution" node was to be performed earlier than the selected node, the following error occurred: "Next move forbidden.

source: Выполнение узла, Узел-ссылка: сообщения об ошибках в указанных узлах сделаны более информативными.
en: Node execution, Reference node: error messages in the specified nodes became more informative.

source: Группировка, Таблица в переменные: Для колонок целого типа, содержащих значения большие 253 - 1 или меньшие -253 + 1 могли возникать ошибки в агрегациях: Минимум, Максимум, Мода, Первый, Последний, Единственный.
en: Grouping, Table to variables: For the columns that relate to the integer type and contain the values that are more than 253 - 1 or less than -253 + 1, errors can occur in aggregations: Minimum, Maximum, Mode, First, Last, Single.

source: Дата и Время: при преобразовании дат в стоковый формат отсутствовали ведущие нули для недели года, недели квартала, дня года и дня квартала.
en: Date and Time: when transforming dates to the string format, there were no leading zeros for year week, quarter week, year day and quarter day.

source: Дерево в таблицу: Исправлена ошибка "Некорректное описание узла", которая возникала при одновременном получении данных несколькими узлами Дерево в таблицу из одного и того же дерева, если корневой узел дерева - массив, содержащий 0 элементов (#9609).
en: Tree to table: The following error was corrected: "Incorrect node description". It occurred while simultaneous receiving of data by several Tree to table nodes from one and the same tree, if the root tree node was represented by the array that contained 0 items (#9609).

source: Дерево в таблицу: Исправлена ошибка "Некорректное описание узла", которая возникала при параллельном получении данных несколькими узлами Дерево в таблицу из одного и того же дерева, если корневой узел дерева - массив, содержащий 0 элементов (#9609).
en: Tree to table: The following error was corrected: "Incorrect node description". It occurred while parallel receiving of data by several Tree to table nodes from one and the same tree, if the root tree node was represented by the array that contained 0 items (#9609).

source: Диспетчер: Если во время закрытия сессии через Диспетчер отсутствовало сетевое соединения с клиентским компьютером или клиентский компьютер находился в спящем режиме, то удаляемая сессия исчезала из списка, а затем сразу появлялась снова.
en: Session Manager: If there was no network connection with the client computer or the client computer was in sleep mode when closing the session via the Session Manager, the deleted session disappeared from the list and then it appeared again.

source: Дубликаты и противоречия: Исправлена ошибка «Abstract method called», которая возникала в визуализаторе Качество данных, настроенном на узле, который получал данные с узла Дубликаты и противоречия (#10201).
en: Duplicates and Contradictions: "Abstract method called" error was corrected. It occurred in the Data quality visualizer configured on the node that received data from the Duplicates and Contradictions node (#10201).

source: Замена: При способе замены Ввод вручную повторное нажатие на кнопку Экспорт для экспорта таблицы замен приводило к ошибке «Невозможно перейти по адресу: blob:...».
en: Replace: When selecting Manual input replace method, the repeated pressing on Export button to export the replacement table caused the following error: "Failed to go to the following address: blob:...".

source: Замена: отключена возможность на входном порту «Таблица замен» выставлять «Назначение».
en: Replace: possibility to set "Usage type" is disabled at the input port "Replacement table".

source: Замена: В обработчик добавлена возможность установки пропущенного (null) значения в поле редакторов заменяемого значения и значения замены.
en: Replace: It became possible to install null values in the editors field of the replaced value and replace value in the handler.

source: Замена: При настройке замены для поля типа Дата/время во внутренней таблице замен переставала работать кнопка Применить, после изменения типа замены на Вещественный и значения в поле Точное совпадение.
en: Replace: When configuring replacement for the field referred to the Date/time type in the internal replacement table, Apply button failed after change of the replacement type to Real and value in the Exact match field.

source: Импорт из 1С: добавлена поддержка временных таблиц в запросах импорта из 1С (#9225).
en: Import from 1С: support of time tables was added in requests of import from 1C (#9225).

source: Импорт из Deductor Warehouse: если пакет с настроенным импортом из Deductor Warehouse сохранить и повторно открыть, то при попытке выполнить узел импорта возникала ошибка «Deductor Warehouse: Не указан объект Хранилища данных» (#8523).
en: Import from Deductor Warehouse: if the package with configured import from Deductor Warehouse is saved and repeatedly opened, while attempting to execute the import node, the following error occurred: "Deductor Warehouse: Data Warehouse object not specified" (#8523).

source: Импорт из Deductor Warehouse: если при формировании списка параметров фильтрации использовались поля с одинаковыми именами, то импорт выполнялся некорректно.
en: Import from Deductor Warehouse: if fields with the same names were used while compiling the filtration parameters list, the import process was executed incorrectly.

source: Импорт из Excel файла: Исправлена ошибка «Failed to open / Не удалось открыть Excel», которая возникала при попытке импортировать файл, полученный экспортом из Power BI или Teradata SQL Assistant (#9849).
en: Import from Excel file: The following error was corrected: "Failed to open / Failed to open Excel". It occurred while attempting to import the file exported from Power BI or Teradata SQL Assistant (#9849).

source: Импорт из Excel файла: Исправлена ошибка "Cannot set properties of undefined (setting 'EmptyListText')", которая возникала, если при настройке импорта после указания Имени файла параметр Выбор объекта задавался неактивной переменной (поданной на узел импорта из неактивированного порта Переменные сценария).
en: Import from Excel file: The following error was corrected: "Cannot set properties of undefined (setting 'EmptyListText')". It occurred if Object selection parameter was set by the inactive variable (supplied to the import node from inactivated port of the Workflow variables) when configuring import after specification of the File name.

source: Импорт из Excel: В импорте из Excel после закрытия мастера настройки узла не сохранялась настройка параметра Имя объекта, заданная переменной.
en: Import from Excel: After closing the node wizard in import from Excel, Object name parameter setting set by the variable was not saved.

source: Импорт из LGD-файла: Так как узел Импорта из LGD-файла не поддерживает изменение типов данных выходных полей, на выходном порту исключили такую возможность.
en: Import from LGD file: As Import from LGD file node does not support change of data types of the output fields, such option was disabled at the output port.

source: Импорт из LGD-файла: Исправлена ошибка, которая появилась в Loginom 7.0.0 и приводила к росту потребления памяти при импорте данных из LGD-файла (#9568).
en: Import from LGD file: The error that appeared in Loginom 7.0.0 and increased memory consumption when importing data from LGD file was corrected (#9568).

source: Импорт из LGD-файла: если при импорте выбрать только часть полей исходного файла, то при определенном сочетании исходных типов данных таких полей, могла возникнуть ошибка, приводящая к непредвиденному завершению приложения.
en: Import from LGD file: if only a part of the source file fileds is selected while importing, the error that causes unexpected application exit could occur on condition of the particular combination of the source data types of such fields.

source: Импорт из LGD: Если для набора данных с одним столбцом в выходном порту удалить выходные поля, добавить поле типа Переменный и связать их, то при запуске узла возникала ошибка: «Метаданные не соответствуют ранее объявленным» (#8426).
en: Import from LGD: If the output fields were deleted for the data set with one column in the output port, the field related to theVariable type was added and they were connected afterwards, the following error occurred when starting the node: "Metadata does not comply with the previously declared metadata" (#8426).

source: Импорт из PostgreSQL: при использовании в запросе одного и того же параметра более одного раза возникала ошибка "Invalid parameters specified" (#8587).
en: Import from PostgreSQL: when one and the same parameter was used more than once in the request, the following error occurred: "Invalid parameters specified" (#8587).

source: Импорт из XML: добавлена проверка существования файла в файловом хранилище, что исключает ошибки при попытке его дальнейшей загрузки.
en: Import from XML: Check of the file availability in the file storage was added. It excludes errors while attempting to load it later on.

source: Импорт из Баз данных: при подключении к MS SQL Server с использованием ODBC драйвера, если в исходной таблице использовались поля типа Integer или SmallInt, то в процессе настройки импорта могла возникать ошибка «Переход запрещен.
en: Import from Databases: when connecting to MS SQL Server using ODBC driver, if the fields of the Integer or SmallInt type were used in the source table, the following error could occur while import configuring: "Next move forbidden.

source: Импорт из Базы данных: если при запуске предварительного просмотра в мастере настройки импорта из базы данных возникала ошибка, то оставался запущенным процесс выполнения узла, который невозможно было отменить через панель процессов (#8378).
en: Import from Database: if an error occurred when starting preview in Import from Database wizard, the node execution process was still running, and it could not be cancelled using the processes bar (#8378).

source: Импорт из базы данных: Если в мастере настройки узла настроить фильтр для списка таблиц, а затем выбрать таблицу из отфильтрованного списка, то можно было получить всплывающее сообщение ­«Таблица(представление)... подготовлена к работе.
en: Import from database: If the table list filter was configured in the node wizard, and then the table was selected from the filtered list, the following pop-up message could be received: "Table (view)... is prepared for work.

source: Импорт из базы данных: В мастере настройки импорта из базы данных при заданном фильтре для выбранных полей на следующей странице мастера настройки поля, не соответствующие установленному фильтру, считались не выбранными.
en: Import from database: The fields that didn't match the set filter were not considered to be selected in the wizard of import from database with the set filter for the selected fields on the next wizard page.

source: Импорт из базы данных: Если в мастере настройки задать через переменную Имя таблицы, открыть Предпросмотр, перейти в режим SQL запрос, задать любой запрос, завершить настройку и выполнить узел, то возникала ошибка: «Выполнение запроса... окончилось неудачно, ...».
en: Import from database: If Table name was set via variable in the wizard, Preview was opened,SQL query mode was selected, any query was specified, setup was completed and node was executed, the following error occurred: "Execution of query... failed, ...».

source: Импорт из базы данных: Не активировались входные переменные при первом запуске предпросмотра результатов SQL-запроса в мастере настройки импорта из БД.
en: Import from database: The input variables were not activated after the first start of the SQL query results preview in the import from DB wizard.

source: Импорт из базы данных: добавлена проверка настроек в мастере импорта из баз данных.
en: Import from Database: settings check was added in import from database wizard.

source: Импорт из текстового файла: при определении списка колонок не добавлялся последний столбец, если последний символ в первой строке — разделитель (#9071).
en: Import from text file: The last column was not added when defining the column list if a separator was the last character in the first row (#9071).

source: Импорт из текстового файла: Оптимизирована обработка значений типа Дата/Время.
en: Import from text file: Processing of Date/Time type values was optimised.

source: Импорт из текстового файла: При импорте из текстового файла значение NaN в столбце, импортируемом как вещественный, сохранялось в наборе данных как NaN, тогда как в этом случае ожидалось пропущенное значение.
en: Import from Text File: When importing from the text file, NaN value in the column imported as the real one was saved in the data set as NaN, whereas the null value was expected in this case.

source: Импорт из текстового файла: если на странице «Параметры импорта с разделителями» была выделена ячейка в столбце, метка которого содержит запятую <,>, то при изменении настроек в мастере возникала ошибка «Invalid ComponentQuery selector: ...» (#7456).
en: Import from Text File: if a cell of the column the caption of which contained a comma <,> was selected on "Import Parameters with Separators" page, the following error occurred when changing the settings in the wizard: "Invalid ComponentQuery selector: ..." (#7456).

source: Инспектор свойств: Оптимизировано начальное заполнение окна инспектора.
en: Property Inspector: The initial filling in of the inspector window was optimised.

source: Инспектор свойств: если более 10 узлов несколько раз подряд сворачивались/разворачивались в Подмодель и при этом был открыт Инспектор свойств, то возникала ошибка «Клиентский прокси-объект финализирован» (#8312).
en: Property Inspector: if more than 10 nodes were collapsed/expanded to the Supernode several times in a row, and Property Inspector was opened in this case, the following error occurred: "Client proxy object disconnected" (#8312).

source: Калькулятор JavaScript: В режиме JavaScript в Калькуляторе строковое выражение Null() возвращало пустую строку, а не Null.
en: JavaScript calculator: In JavaScript mode in Calculator string Null() expression returned the empty string but not Null.

source: Калькулятор: В режиме работы ­«Выражение» разрешено выполнение оператора NOT со значениями переменного типа (NOT VAR, где VAR - любое выражение с результатом переменного типа).
en: Calculator: NOT operator execution with the values related to the variable type (NOT VAR where VAR - any expression with the result related to the variable type) is allowed in the "Expression" mode of operation.

source: Калькулятор: Если изменить выражение и, не выходя из редактора, нажать клавишу F3 (открыть Предпросмотр), то результат в Предпросмотре не учитывал последние изменения.
en: Calculator: If the user changed the expression and pressed F3 key without exiting the editor (open Preview), changes were not taken into account in the result in Preview.

source: Калькулятор: при вычислении кумулятивной суммы могла возникать ошибка, если параллельно из нескольких узлов происходило обращение к одному экземпляру узла Калькулятор (например, в Цикле) (#8160).
en: Calculator: when calculating the cumulative sum, an error could occur if one Calculator node instance was accessed from several nodes in parallel (for example, in the Loop) (#8160).

source: Калькулятор: Если в узле Калькулятор добавить несколько выражений, одно из них открыть на редактирование и в таком состоянии удалить, то переставал работать Drag&Drop выражений (выражения можно было перемещать вверх или вниз только с помощью кнопок).
en: Calculator: If several expressions were added in the Calculator node, one of them was opened for editing and deleted in such state, Drag&Drop designated for expressions stopped working (it was possible to drag the expressions up or down only using the buttons).

source: Калькулятор: Исправлены ошибки в логике активации/деактивации пунктов "Переместить вверх", "Переместить вниз", "Удалить" контекстного меню списка выражений (#4498).
en: Calculator: Errors in logics of activation/deactivation of "Move up", "Move down" context menu items of the expression list were corrected (#4498).

source: Калькулятор: не определялись в качестве обязательных входные переменные, используемые в выражениях Калькулятора с префиксом (#8243).
en: Calculator: the input variables used in the Calculator expressions with a prefix were not defined as the required input variables (#8243).

source: Калькулятор: исправлена ошибка Access violation, которая возникала в режиме JavaScript в случае, если пользователь допустил синтаксические ошибки в выражении, проигнорировал сообщение о наличии синтаксической ошибки и запустил узел Калькулятор (#9224).
en: Calculator: Access violation error that occurred in JavaScript mode was corrected if a user made syntactic errors in the expression, ignored the message concerning the syntactic error occurrence and started Calculator node (#9224).

source: Качество бинарной классификации: при копировании в буфер обмена данных из матрицы ошибок к значениям в столбце Классифицировано добавлялся лишние символы % (#8638).
en: Binary classification assessment: when copying data from error matrix to the clipboard to the values in Predicted column, extra % symbols were added (#8638).

source: Квантование: Исправлена ошибка формирования интервалов методом Ширина, когда на вход подано одно целочисленное значение.
en: Binning: The error of bins generation using the Width method was corrected when one integer value was supplied to the input.

source: Квантование: если в мастере настройки нажималась кнопка «Образец», то при повторном выполнении узла или при закрытии сценария после выполнения узла возникала ошибка (#8720).
en: Binning: if the "Sample" button was pressed in the wizard, an error occurred when the node was repeatedly opened or workflow closed after the node execution (#8720).

source: Кластеризация: в случае, если процесс обучения принудительно останавливался, остановка процесса происходила сразу, без ожидания завершения текущего этапа (#7760).
en: Clustering: if the training process was forcedly stopped, the process was stopped at once not waiting for the current stage termination (#7760).

source: Конечные классы: Открытие в браузере страницы мастера настройки узла Конечные классы по ссылке, полученной по кнопке Поделиться, приводило к ошибке: «При переходе на "Конечные классы.
en: Coarse сlasses: Opening of the wizard of the Coarse сlasses node in the page browser following the link received using Share button, caused the following error: "When switching to "Coarse classes.

source: Конечные классы: при активации узла выполнялась лишняя сортировка начальных классов для входных дискретных полей, в результате чего для могла изменяться модель (#7922).
en: Coarse сlasses: on activation of the node unnecessary sorting of initial classes for the input discrete fields was perfomed that could change the model (#7922).

source: Конечные классы: В мастере настройки узла для выходного дискретного поля переменного типа не сохранялось установленное Настраиваемое значение "события".
en: Coarse сlasses: The set Configured "event" value was not saved in the node wizard for the output discrete field related to the variable type.

source: Конечные классы: Для параметра Максимальное количество классов на втором шаге настройки был установлен диапазон допустимых значений [0, 1000], а на третьем — [1, 100].
en: Coarse сlasses: The range of allowed values equal to [0, 1000] was set at the second configuration step and [1, 100] - at the third configuration step for the Maximum class count parameter .

source: Конечные классы: Если в настроенном узле Конечные классы удалить поле с назначением Входное, сохранить настройки и запустить узел, возникала ошибка "Нет ссылки на набор данных".
en: Coarse сlasses: If the field with Input usage type was deleted, settings were saved and node was started in the configured Coarse сlasses node, the following error occurred: "No reference to data set".

source: Конечные классы: если непрерывное входное поле не содержало ни одного значения, то узел переобучался, но потом его нельзя было активировать (#8298).
en: Coarse classes: if the continuous input field contained no values, the node was retrained but it was not possible to activate it later (#8298).

source: Конечные классы: иногда возникала ошибка «Assertion failure» при удалении поля у активированного ранее узла в мастере настройки.
en: Coarse сlasses: Sometimes "Assertion failure" error occurred when deleting the field of the earlier activated node in the wizard.

source: Конечные классы: при переходе в мастере настройки назад со страницы настройки разбиения, а затем обратно, если изменялись настройки, влияющие на количество классов, то на страницах мастера продолжало отображаться предыдущее количество классов.
en: Coarse сlasses: when moving in the wizard back from the binning configuration page and then backwards, if the settings that had influence on class count had been changed, the previous class count was displayed on the wizard pages.
